In [5]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

# <div class="girk">Series & DataFrame</div><i class="fa fa-lightbulb-o "></i>

In [6]:
series_obj = Series(np.arange(8), # output: 0:7
                    #numpy.arange([start, ]stop, [step, ]dtype=None)
       index = ['row 1','row 2',
                'row 3','row 4',
                'row 5','row 6',
                'row 7', 'row 8'])
# pandas.Series(data=None, index=None, 
# dtype=None, name=None, copy=False, fastpath=False)

In [7]:
series_obj

row 1    0
row 2    1
row 3    2
row 4    3
row 5    4
row 6    5
row 7    6
row 8    7
dtype: int64

In [8]:
series_obj['row 7']

6

In [9]:
series_obj[[0,7]]
# series_obj[[0]]
# series_obj[[5]] #position call, 0 as start

row 1    0
row 8    7
dtype: int64

In [10]:
np.random.seed(25)  #随机数组第25
# DataFrame([data, index, columns, dtype, copy])

DF_obj = DataFrame(
    np.random.rand(36).reshape((6, 6)),  # reshape 行列数量
    index=['row 1', 'row 2', 'row 3', 'row 4', 'row 5', 'row 6'],  # 行名称
    columns=[
        'column 1', 'column 2', 'column 3', 'column 4', 'column 5', 'column 6'
    ])

In [11]:
DF_obj

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
row 2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
row 3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
row 4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
row 5  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
row 6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [12]:
DF_obj.loc[['row 2', 'row 5'], ['column 5', 'column 2']]

       column 5  column 2
row 2  0.402366  0.437611
row 5  0.421004  0.559053

## <span class="mark">DataSlicing</span>

In [13]:
series_obj['row 3':'row 7']

row 3    2
row 4    3
row 5    4
row 6    5
row 7    6
dtype: int64

## <div class="mark">Scaler</div><i class="fa fa-lightbulb-o "></i>

In [14]:
DF_obj <.2

       column 1  column 2  column 3  column 4  column 5  column 6
row 1     False     False     False      True     False      True
row 2     False     False     False     False     False      True
row 3     False     False      True     False     False     False
row 4     False     False     False     False     False     False
row 5     False     False      True     False     False     False
row 6     False     False     False     False     False     False


## <div class="mark">Filter</div><i class="fa fa-lightbulb-o "></i>

In [15]:
series_obj[series_obj > 6]

row 8    7
dtype: int64

In [22]:
# DF_obj["column 3" > .3]

TypeError: '>' not supported between instances of 'str' and 'float'

In [17]:
series_obj['row 1', 'row 5', 'row 8'] = 8 # 给特定行赋值

In [23]:
series_obj

row 1    8
row 2    1
row 3    2
row 4    3
row 5    8
row 6    5
row 7    6
row 8    8
dtype: int64

--------------------------------------------

# <span class="girk">Chapte 2 - NAs.</span>

In [20]:
missing = np.nan # na numbers.
series_obj = Series(['row 1','row 2', 
                     missing,'row 4',
                     'row 5','row 6',
                     missing, 'row 8'])
series_obj

0    row 1
1    row 2
2      NaN
3    row 4
4    row 5
5    row 6
6      NaN
7    row 8
dtype: object

## <span class="mark">Judge NA</span>

In [21]:
series_obj.isnull() # if NA?

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
dtype: bool

In [22]:
np.random.seed(25)
DF_obj = DataFrame(np.random.rand(36 # how many number you need from this seed
                                 ).reshape(6,6))
DF_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
3  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
4  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
5  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [24]:
DF_obj.loc[3:5, 0] = missing
DF_obj.loc[1:4, 5] = missing
DF_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366       NaN
2  0.447031  0.585445  0.161985  0.520719  0.326051       NaN
3       NaN  0.836375  0.481343  0.516502  0.383048       NaN
4       NaN  0.559053  0.034450  0.719930  0.421004       NaN
5       NaN  0.900274  0.669612  0.456069  0.289804  0.525819

## <span class="mark">Fill_NA</span>

In [25]:
filled_DF = DF_obj.fillna(0) # fill with 0
filled_DF

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.000000
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.000000
3  0.000000  0.836375  0.481343  0.516502  0.383048  0.000000
4  0.000000  0.559053  0.034450  0.719930  0.421004  0.000000
5  0.000000  0.900274  0.669612  0.456069  0.289804  0.525819

In [51]:
filled_DF = DF_obj.fillna({0:0.1, 5:1.25}) 
# column_0 and column_5
filled_DF

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  1.250000
2  0.447031  0.585445  0.161985  0.520719  0.326051  1.250000
3  0.100000  0.836375  0.481343  0.516502  0.383048  1.250000
4  0.100000  0.559053  0.034450  0.719930  0.421004  1.250000
5  0.100000  0.900274  0.669612  0.456069  0.289804  1.250000

In [58]:
# test = DF_obj.fillna(value={0:3, 5:5})
# test
# this is the same as last

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  5.000000
2  0.447031  0.585445  0.161985  0.520719  0.326051  5.000000
3  3.000000  0.836375  0.481343  0.516502  0.383048  5.000000
4  3.000000  0.559053  0.034450  0.719930  0.421004  5.000000
5  3.000000  0.900274  0.669612  0.456069  0.289804  5.000000

In [60]:
fill_DF = DF_obj.fillna(method = 'ffill') 
# last none null column value passed to nas.
fill_DF

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.117376
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.117376
3  0.447031  0.836375  0.481343  0.516502  0.383048  0.117376
4  0.447031  0.559053  0.034450  0.719930  0.421004  0.117376
5  0.447031  0.900274  0.669612  0.456069  0.289804  0.117376

## <span class="mark">counting NAs.</span>

In [61]:
DF_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366       NaN
2  0.447031  0.585445  0.161985  0.520719  0.326051       NaN
3       NaN  0.836375  0.481343  0.516502  0.383048       NaN
4       NaN  0.559053  0.034450  0.719930  0.421004       NaN
5       NaN  0.900274  0.669612  0.456069  0.289804       NaN

In [67]:
DF_obj.isnull().sum().sum()

8

In [27]:
DF_no_NAN = DF_obj.dropna(axis = 0) # keep rows
DF_no_NAN

          0         1         2         3       4         5
0  0.870124  0.582277  0.278839  0.185911  0.4111  0.117376

In [70]:
DF_no_NAN = DF_obj.dropna(axis = 1) # keep culumns 
DF_no_NAN

          1         2         3         4
0  0.582277  0.278839  0.185911  0.411100
1  0.437611  0.556229  0.367080  0.402366
2  0.585445  0.161985  0.520719  0.326051
3  0.836375  0.481343  0.516502  0.383048
4  0.559053  0.034450  0.719930  0.421004
5  0.900274  0.669612  0.456069  0.289804

# <span class="girk">Chapter 3, duplicates</span>

In [28]:
DF_obj = DataFrame({'column 1':[1,1,2,2,3,3,3],
                   'column 2':['a','a','b','b','c','c','c'],
                   'column 3':['A','A','B','B','C','C','C']})

DF_obj

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

In [32]:
DF_obj.duplicated() # if same with previous rows.

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

In [33]:
DF_obj.drop_duplicates()

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C

# <div class="girk">Concatenating and transforming</div><i class="fa fa-lightbulb-o "></i>

In [23]:
# del DF_no_NAN
DF_obj = pd.DataFrame(np.arange(36).reshape(6,6))
DF_obj

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [24]:
DF_obj_2 = pd.DataFrame(np.arange(15).reshape(5,3))
DF_obj_2

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [25]:
pd.concat([DF_obj, DF_obj_2], axis=1) # column bind

    0   1   2   3   4   5     0     1     2
0   0   1   2   3   4   5   0.0   1.0   2.0
1   6   7   8   9  10  11   3.0   4.0   5.0
2  12  13  14  15  16  17   6.0   7.0   8.0
3  18  19  20  21  22  23   9.0  10.0  11.0
4  24  25  26  27  28  29  12.0  13.0  14.0
5  30  31  32  33  34  35   NaN   NaN   NaN

In [26]:
pd.concat([DF_obj, DF_obj_2]) # row bind, auto-add blank value as NaN

    0   1   2     3     4     5
0   0   1   2   3.0   4.0   5.0
1   6   7   8   9.0  10.0  11.0
2  12  13  14  15.0  16.0  17.0
3  18  19  20  21.0  22.0  23.0
4  24  25  26  27.0  28.0  29.0
5  30  31  32  33.0  34.0  35.0
0   0   1   2   NaN   NaN   NaN
1   3   4   5   NaN   NaN   NaN
2   6   7   8   NaN   NaN   NaN
3   9  10  11   NaN   NaN   NaN
4  12  13  14   NaN   NaN   NaN

In [27]:
DF_obj.drop([0,2]) # row drop # position 0 and 2
# also you can drop columns with 'axis = 1'.

    0   1   2   3   4   5
1   6   7   8   9  10  11
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [28]:
series_obj = Series(np.arange(6))

In [29]:
series_obj.name = "added_variable" # add name to series.
series_obj

0    0
1    1
2    2
3    3
4    4
5    5
Name: added_variable, dtype: int64

In [30]:
variable_added = DataFrame.join(DF_obj, series_obj)
variable_added

    0   1   2   3   4   5  added_variable
0   0   1   2   3   4   5               0
1   6   7   8   9  10  11               1
2  12  13  14  15  16  17               2
3  18  19  20  21  22  23               3
4  24  25  26  27  28  29               4
5  30  31  32  33  34  35               5

In [34]:
# alternatively use append method.
added_datatable = variable_added.append(variable_added, 
                                        ignore_index=False)
# 自己和自己append
added_datatable = variable_added.append(variable_added, 
                                        ignore_index=True)
# # this one with continuous index. 
added_datatable

     0   1   2   3   4   5  added_variable
0    0   1   2   3   4   5               0
1    6   7   8   9  10  11               1
2   12  13  14  15  16  17               2
3   18  19  20  21  22  23               3
4   24  25  26  27  28  29               4
5   30  31  32  33  34  35               5
6    0   1   2   3   4   5               0
7    6   7   8   9  10  11               1
8   12  13  14  15  16  17               2
9   18  19  20  21  22  23               3
10  24  25  26  27  28  29               4
11  30  31  32  33  34  35               5

In [65]:
DF_sorted = DF_obj.sort_values(by = (5), ascending = [False])
# 对第五列sort, ascending = False.
DF_sorted

    0   1   2   3   4   5
5  30  31  32  33  34  35
4  24  25  26  27  28  29
3  18  19  20  21  22  23
2  12  13  14  15  16  17
1   6   7   8   9  10  11
0   0   1   2   3   4   5

# <div class="girk">Subgrrouping
</div><i class="fa fa-lightbulb-o "></i>

In [35]:
address = '/Users/fyenne/Desktop/booooks/python/Python_course/Exercise Files/Data/mtcars.csv'
cars = pd.read_csv(address, header='infer')

# cars.columns = ['car_names','mpg','cyl',]
cars.columns.values[0]='car_name' # rename first_position, col_name 
cars.head()

,car_name,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [36]:
cars_groups = cars.groupby(cars['cyl']) # group_by cyl
cars_groups.mean()

,mpg,disp,hp,drat,wt,qsec,vs,am,gear,carb
cyl,,,,,,,,,,
4,26.663636,105.136364,82.636364,4.070909,2.285727,19.137273,0.909091,0.727273,4.090909,1.545455
6,19.742857,183.314286,122.285714,3.585714,3.117143,17.977143,0.571429,0.428571,3.857143,3.428571
8,15.100000,353.100000,209.214286,3.229286,3.999214,16.772143,0.000000,0.142857,3.285714,3.500000

# <div class="girk">Data visualization.
</div><i class="fa fa-lightbulb-o "></i>

In [ ]:
# in next document